Revit 2015 API
AnalyticalModel.IsValidDirectionForProjection Method
 Indicates if the input direction is valid for Analytical Model projection.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2011
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2015. It was used as validator to AnalyticalModel.SetAnalyticalProjectionType() method that was deprecated and replaced by AnalyticalModelStick.SetProjection() method or one of AnalyticalModelSurface.ProjectionZ, AnalyticalModelSurface.BottomExtension, AnalyticalModelSurface.TopExtension properties depending on arguments.")]
public bool IsValidDirectionForProjection(
	AnalyticalDirection direction
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2015. It was used as validator to AnalyticalModel.SetAnalyticalProjectionType() method that was deprecated and replaced by AnalyticalModelStick.SetProjection() method or one of AnalyticalModelSurface.ProjectionZ, AnalyticalModelSurface.BottomExtension, AnalyticalModelSurface.TopExtension properties depending on arguments.")> _
Public Function IsValidDirectionForProjection ( _
	direction As AnalyticalDirection _
) As Boolean
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2015. It was used as validator to AnalyticalModel.SetAnalyticalProjectionType() method that was deprecated and replaced by AnalyticalModelStick.SetProjection() method or one of AnalyticalModelSurface.ProjectionZ, AnalyticalModelSurface.BottomExtension, AnalyticalModelSurface.TopExtension properties depending on arguments.")]
public:
bool IsValidDirectionForProjection(
	AnalyticalDirection direction
)
Parameters
direction
Type: Autodesk.Revit.DB.Structure.AnalyticalDirection
 Direction in which the Analytical Model may be projected.
Return Value
 True if AnalyticalDirection is valid for Element, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace